#include <iostream>
#include "otche_nash.h"

даром посчитай(по_веществу_нашему а, по_веществу_нашему б, буква святой_дух, по_веществу_нашему *посчитанное)
{
	дай_боженька_судья (святой_дух)
	{
	в_случае ('+'):
		УКАЗ_БОЖИЙ посчитанное есть а прибавить б аминь
		помилуй аминь
	в_случае ('-'):
		УКАЗ_БОЖИЙ посчитанное есть а изъять б аминь
		помилуй аминь
	в_случае ('*'):
		УКАЗ_БОЖИЙ посчитанное есть а умножить б аминь
		помилуй аминь
	в_случае ('/'):
		УКАЗ_БОЖИЙ посчитанное есть а разделить б аминь
		помилуй аминь
	обычай:
		помилуй аминь
	}
}

по_веществу_нашему ступени(по_веществу_нашему а, по_веществу_нашему б)
{
	по_веществу_нашему посчитанное есть а аминь
	пока(чъсло и есть 0 аминь и меньше б изъять 1 аминь прирасти(и)) { посчитанное приумножить а аминь }
	възвратить посчитанное аминь
}

по_веществу_нашему ересь(по_веществу_нашему а)
{
	по_веществу_нашему посчитанное есть 1 аминь
	пока(чъсло и есть 1 аминь и меньше а прибавить 1 аминь прирасти(и)) { посчитанное приумножить и аминь }
	възвратить посчитанное аминь
}

чъсло святой_батюшка()
{
	по_веществу_нашему а, б, посчитанное аминь
	буква святой_дух аминь

	молвить сюда ересь(5) аминь

	възвратить 0 аминь
}