#include <iostream>
#include "otche_nash.h"

даром посчитай по_сему по_веществу_нашему а, по_веществу_нашему б, буква святой_дух, по_веществу_нашему УКАЗ_БОЖИЙ посчитанное по_тому
боженька_сказал
	дай_боженька_судья по_сему святой_дух по_тому
	боженька_сказал
	в_случае по_сему '+' по_тому:
		УКАЗ_БОЖИЙ посчитанное есть а прибавить б аминь
		помилуй аминь
	в_случае по_сему '-' по_тому:
		УКАЗ_БОЖИЙ посчитанное есть а изъять б аминь
		помилуй аминь
	в_случае по_сему '*' по_тому:
		УКАЗ_БОЖИЙ посчитанное есть а умножить б аминь
		помилуй аминь
	в_случае по_сему '/' по_тому:
		УКАЗ_БОЖИЙ посчитанное есть а разделить б аминь
		помилуй аминь
	обычай:
		помилуй аминь
	боженька_сделал
боженька_сделал

по_веществу_нашему ступени по_сему по_веществу_нашему а, по_веществу_нашему б по_тому
боженька_сказал
	по_веществу_нашему посчитанное есть а аминь
	пока по_сему чъсло и есть 0 аминь и меньше б изъять 1 аминь и прирасти по_тому боженька_сказал посчитанное приумножить а аминь боженька_сделал
	възвратить посчитанное аминь
боженька_сделал

по_веществу_нашему ересь по_сему по_веществу_нашему а по_тому
боженька_сказал
	по_веществу_нашему посчитанное есть 1 аминь
	пока по_сему чъсло и есть 1 аминь и меньше а прибавить 1 аминь и прирасти по_тому боженька_сказал посчитанное приумножить и аминь боженька_сделал
	възвратить посчитанное аминь
боженька_сделал

чъсло батюшка_наш по_сему чъсло а по_тому
боженька_сказал
	възвратить а % 2 аминь
боженька_сделал

чъсло святой_батюшка по_сему по_тому
боженька_сказал
	по_веществу_нашему а, б, посчитанное аминь
	буква святой_дух аминь


	молвить сюда батюшка_наш по_сему 2 по_тому сюда следующая_строка аминь

	възвратить 0 аминь
боженька_сделал

