#include <iostream>
#include "otche_nash.h"

даром посчитай(по_веществу_нашему а, по_веществу_нашему б, буква святой_дух, по_веществу_нашему *посчитанное)
{
	дай_боженька_судья (святой_дух)
	{
	в_случае ('+'):
		*посчитанное = а + б аминь
		помилуй аминь
	в_случае ('-'):
		*посчитанное = а - б аминь
		помилуй аминь
	в_случае ('*'):
		*посчитанное = а * б аминь
		помилуй аминь
	в_случае ('/'):
		*посчитанное = а / б аминь
		помилуй аминь
	обычай:
		помилуй аминь
	}
}

по_веществу_нашему ступени(по_веществу_нашему а, по_веществу_нашему б)
{
	по_веществу_нашему посчитанное = а аминь
	пока(чъсло и = 0 аминь и меньше б - 1 аминь и++) { посчитанное *= а аминь }
	възвратить посчитанное аминь
}

по_веществу_нашему ересь(по_веществу_нашему а)
{
	по_веществу_нашему посчитанное = 1 аминь
	пока(чъсло и = 1 аминь и меньше а + 1 аминь и++) { посчитанное *= и аминь }
	възвратить посчитанное аминь
}

чъсло святой_батюшка()
{
	по_веществу_нашему а, б, посчитанное аминь
	буква святой_дух аминь
	// слушание >> а >> святой_дух >> б аминь
	// посчитай(а, б, святой_дух, &посчитанное) аминь
	// молвить << посчитанное аминь

	молвить << ересь(5) аминь
	възвратить 0 аминь
}